app/controllers/pcomponents_controller.rb

SELECT "pcomponents".* FROM "pcomponents" WHERE "pcomponents"."id" = 1 LIMIT 1
---
  def edit
    @pcomponent = Pcomponent.find(params[:id])

SELECT "pcomponents".* FROM "pcomponents" WHERE "pcomponents"."id" = 1 LIMIT 1
UPDATE "pcomponents" SET "status_id" = 2, "updated_at" = '2011-05-15 23:49:09.321440' WHERE "pcomponents"."id" = 2
---
   def update
    @pcomponent = Pcomponent.find(params[:id])

    update_was_successful = @pcomponent.update_attributes(params[:pcomponent])