app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "projects"
---
  def index
    @projects = Project.paginate :page => params[:page]

INSERT INTO "projects" ("title", "due_date", "created_at", "updated_at") VALUES ('Project 1', '2010-02-06', '2011-05-15 21:48:28.714479', '2011-05-15 21:48:28.714479')
SELECT "components".* FROM "components"
INSERT INTO "pcomponents" ("project_id", "component_id", "user_id", "status_id", "created_at", "updated_at") VALUES (7, 1, NULL, NULL, '2011-05-15 22:51:09.538033', '2011-05-15 22:51:09.538033')
SELECT "questions".* FROM "questions"
INSERT INTO "pquestions" ("question_id", "project_id", "rate", "comment", "created_at", "updated_at") VALUES (1, 3, NULL, NULL, '2011-05-16 23:01:39.852967', '2011-05-16 23:01:39.852967')
---
  def create
    @project = Project.new(params[:project])

    new_was_successful = @project.save

      respond_with(@project) do |format|
        format.html {
          if new_was_successful
            components = Component.all
            components.each do |c|
              pc = Pcomponent.new
              pc.project = @project
              pc.component = c
              pc.save
            end

            questions = Question.all
            questions.each do |q|
              pq = Pquestion.new
              pq.project = @project
              pq.question = q
              pq.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1
UPDATE "projects" SET "title" = 'Project 1', "updated_at" = '2011-05-15 23:04:19.755159' WHERE "projects"."id" = 1
---
  def update
    @project = Project.find(params[:id])

     updated_was_successful = @project.update_attributes(params[:project])